---
kind: enumMember
id: F:Autodesk.Revit.DB.AdaptivePointConstraintType.None
enum: Autodesk.Revit.DB.AdaptivePointConstraintType
source: html/9aa479aa-36be-bf1b-7570-026afcd4d02e.htm
---
# Autodesk.Revit.DB.AdaptivePointConstraintType.None

Not constrained.